In [55]:
import pandas as pd
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [56]:
import pandas as pd
emp=pd.Series(['Dharun','Sudeep','Siva','Yash','Ravi'])
id=pd.Series([80,90,28,57,49])
frame={'Emp':emp,'ID':id}
res=pd.DataFrame(frame)
print("\nseries to Dataframe\n")
print(res)

series to Dataframe

      Emp  ID
0  Dharun  80
1  Sudeep  90
2    Siva  28
3    Yash  57
4    Ravi  49

In [57]:
print("\n Extracting one column\n")
print(res['Emp'])

 Extracting one column

0    Dharun
1    Sudeep
2      Siva
3      Yash
4      Ravi
Name: Emp, dtype: object

In [58]:
print('\nAdding one column:\n')
res['ID']=pd.Series([80,90,28,56,89])
res['Age']=pd.Series([29,30,31,33,28])
print(res)

Adding one column:

      Emp  ID  Age
0  Dharun  80   29
1  Sudeep  90   30
2    Siva  28   31
3    Yash  56   33
4    Ravi  89   28

In [59]:
print("\n Deleting new column \n")
del res['Age']
print(res)

 Deleting new column

      Emp  ID
0  Dharun  80
1  Sudeep  90
2    Siva  28
3    Yash  56
4    Ravi  89

In [60]:
print('\n Extracting the second row: \n')
print(res.loc[1])

 Extracting the second row:

Emp    Sudeep
ID         90
Name: 1, dtype: object

In [61]:
print("Slice rows :\n",res[1:4])

Slice rows :
       Emp  ID
1  Sudeep  90
2    Siva  28
3    Yash  56

In [64]:
d2=pd.DataFrame([['Vicky',100],['Rashid',109]],columns=['Emp','ID'])
print("\n Adding new row values : \n",pd.concat([res,d2]))

 Adding new row values :
       Emp   ID
0  Dharun   80
1  Sudeep   90
2    Siva   28
3    Yash   56
4    Ravi   89
0   Vicky  100
1  Rashid  109

In [63]:
print("\n Detelting particular row:\n",res.drop(2))

 Detelting particular row:
       Emp  ID
0  Dharun  80
1  Sudeep  90
3    Yash  56
4    Ravi  89